package Tasks;

public class Task_2_5 {
    public static void main(String[] args) {

        // С некоторого момента прошло 234 дня

        int daysPassed = 234;

        // Найти сколько полных недель прошло за этот период?

        int weeksPassed = daysPassed / 7;
        System.out.println("Полных недель прошло: " + weeksPassed);

    }
}
